/**
 * KISS - Keep It Simple, Stupid! (делайте вещи проще)
 * Не нужно усложнять дизайн там, где это не нужно. Чем проще, тем лучше!
 *
 * DRY - Don't Repeat Yourself! (не повторяйтесь)
 * Не нужно "изобретать велосипед". Любой функционал в коде должен быть реализован ровно один раз, 
 * не говоря уже о том, что copy-paste кода вообще не должно быть.
 *
 * YAGNI - You Ain't Gonna Need It (Вам это не понадобится)
 * нужно ориентироваться на реальную экономическую необходимость. Если от кода не требуется каких-то вещей, 
 * то не нужно их реализовывать. Например если Вы работаете над маленьким сайтом, который надо сдать в сжатые сроки,
 * и который приурочен к одному мероприятию, после чего будет закрыт, то не надо продумывать его архитектуру 
 * с точки зрения возможного расширения функционала в будущем. В общем, надо оценивать необходимость своего труда взвешенно.
 * 
 */
